# =============================================================================
#  Version: 0.1 (April 29, 2019)
#  Author: 김동욱 (datalama@amorepacific.com), 디지털R&D팀
#
#  Contributors:
#
# =============================================================================
#  This is the Function of AP NLP preprocessing.
# =============================================================================

import re
import os
import sys
import json
import boto3
import subprocess
import itertools

from multiprocessing import Pool
from konlpy.tag import Mecab





def list2json(batch, size=52428800): 
    """
    Split huge dataset and generate small json files
    
    * batch : list of dictionary that can be converted into json.
    * size : size of json pieces.(defualt = 50MB)
    """
    
    size_checker = 0 
    fn_num = 0
    piece_list = []
    
    for dic in batch:
        
        if size_checker > size: # 기준 size보다 string이 커지면 저장.
            file_name = f"namu_{fn_num:03d}" 
            with open(f'./namu/{file_name}', 'w') as f:
                f.write('\n'.join(piece_list))
                
            size_checker = 0
            fn_num +=1
            piece_list = []
                
        else: 
            piece = json.dumps(dic)
            size_checker += sys.getsizeof(piece) # history of pieces
            piece_list.append(piece)

    # 마지막 나머지 저장!
    with open(f'./namu/namu_{fn_num:03d}', 'w') as f:
        f.write('\n'.join(piece_list))
        
    print('끝!!!')
    return




def uploads_to_s3(bucket, data_key, directory):
    """
    Upload dir and files to s3
    
    * bucket : s3 bucket
    * datakey : s3 directory where you want to save
    * directory : ec2 local's directory(file들이 저장된 directory... s3에 dir과 file들을 함께 업로드함.)
    """
    
    ## file_names
    fns = subprocess.check_output(['ls', '-l', f'{directory}'],stderr=subprocess.PIPE, universal_newlines=True)
    fns = [x.split()[-1] for x in fns.split('\n')[1:-1]] # file_name_lists
    
    ## s3
    s3 = boto3.resource('s3')
    
    ## uploads
    for file in fns:
        file_name = directory + '/' + file
        with open(file_name, 'rb') as f:
            data = f.read()
            key = data_key + '/' + file_name
            s3.Bucket(bucket).put_object(Key = key, Body = data)

    print('FINISH!!!')
    return

class DatasetFromS3(object):
    """
    S3에서 데이터 끌어와서 SageMaker 또는 Local에 저장하기.
    
    USAGE
    * self.executre(loca_dir = [your_directory])
    """
    def __init__(self, bucket = 'ap.nlp', directory = 'dataset/general_language'):
        self.bucket =  bucket
        self.directory = directory
        self.s3r = boto3.resource('s3')
        self.s3c = boto3.client('s3')
        self.channel_list = [obj.key for obj in self.s3r.Bucket(bucket).objects.all() if (directory in obj.key) & (re.search('(\d)$', obj.key) != None)] # 해당 dir에서 끝 자리가 수로 끝나는 데이터들 추출.
        
    def __repr__(self):
        return f"DatasetFromS3('{self.bucket}', '{self.directory}')"
    
    def __str__(self):
        return f"Get Dataset In {self.bucket} Where {self.directory})"
    
    def _data_loader(self):
        """
        S3에서 데이터를 generator를 활용해 끌어온다.
        * output - list of dictionary
        """
        for channel in self.channel_list:
            obj = self.s3c.get_object(Bucket = self.bucket, Key = channel)
            yield obj['Body'].read().decode('utf-8')
            
    def execute(self, local_dir = 'dataset_raw'):
        ## loader_gen
        self.loader_gen = self._data_loader()
        
        ## safe mkdir
        try:
            os.mkdir(local_dir)
        except OSError:
            pass
        
        ## save iterably
        for i, doc_str in enumerate(self.loader_gen):
            file_name = f"./{local_dir}/data{i:03d}"
            with open(file_name, 'w') as f:
                f.write(doc_str)
                
                
                
class TextPreprocessor(object):
    """
    argparse로 scripting할 수 있도록 만들기.
    multiprocessing 가능하도록 만들기.
    """
    def __init__(self, local_dir, beauty = False, sub_pos = True):
        self.local_dir = local_dir
        self.Meaningful_Pos_set = set(['NNG', 'NNP', 'VV', 'VA', 'IC', 'ETN', 'ETM', 'XPN', 'XSN', 'XR'])
        self.beauty = beauty # beauty preprocessing
        self.sub_pos = sub_pos
        self.syn_dict = syn_dict
        
        ## file_name_list
        fns = subprocess.check_output(['ls', '-l', f'{local_dir}'],stderr=subprocess.PIPE, universal_newlines=True)
        self.fns = [x.split()[-1] for x in fns.split('\n')[1:-1]]
        
        
        
    def __repr__(self):
        pass
    
    def __str__(self):
        pass


            
    def _base_preprocessing(self, str_list): 
        str_list = [re.sub(r'http\S+', r'<URL>', text) for text in str_list]
        str_list = [re.sub('[~!@#$%^&*><)(-+_=/|\:;}{].', ' ', text) for text in str_list]
        str_list = [re.sub('[^0-9a-zA-Z가-힣]', ' ', text) for text in str_list]
        str_list = [text.upper() for text in str_list]
        return str_list    
    
    def _tokenizer(self, str_list):
        """
        mecab 사용 ## wrapping된애는 init하지마.. multiprocessing안됨.
        output - list of token list
        """
        mecab = Mecab()
        
        if self.sub_pos and self.beauty: # sub pos
            tokened_str_list  = [mecab.pos(text) for text in str_list]
            return [[token if self.syn_dict.get(token) == None else self.syn_dict.get(token) for token, pos in token_set if pos in self.Meaningful_Pos_set] for token_set in tokened_str_list if token_set != []]
        
        elif self.sub_pos and not self.beauty:
            tokened_str_list  = [mecab.pos(text) for text in str_list]
            return [[token for token, pos in token_set if pos in self.Meaningful_Pos_set] for token_set in tokened_str_list if token_set != []]

        else: # all pos
            return [mecab.morphs(text) for text in str_list]
        
            
    def _work(self, doc):
        """
        1. text에 대하여 split('\n') 적용.(정확한 문장 단위는 아니지만 어느 정도 근접함.)
        2. base_preprocessing
        3. tokenizing
        4. synonym 처리.
        """        
        
        if self.beauty:
            return
        else:
            return self._tokenizer(self._base_preprocessing(doc['content'].split('\n')))
    

    def w2v_token_gen(self, workers = 1):
        """
        multiprocessing
        _data_loader => _base_preprocessing => _tokenizer => _synonym_replace
        """

        for file in self.fns:
            file_name = self.local_dir + '/' + file
            with open(file_name,'r') as f:
                doc_list = [json.loads(dic) for dic in f.readlines()]
            
            with Pool(processes = workers) as pool:
                yield list(itertools.chain(*pool.map(self._work, doc_list))) # 3중 list => 2중 list


            

#### synonym_dictionary            

syn_dict = {'1회용': '일회용', '2-in-1제품': '2IN1', '2STEP': '투스텝', '2WAY': '투웨이', '2중': '이중', '2톤': '투톤', '3-in-1제품': '3IN1', '3중': '삼중', '4계절': '사계절', 'ACTIVE': '액티브', 'AGING': '에이징', 'AHA': '아하', 'AMPOULE': '앰플', 'ANTI': '안티', 'APMALL ': 'AP몰', 'ARGAN': '아르간', 'ARITAUM': '아리따움', 'BABY': '베이비', 'BALANCE': '밸런스', 'BALANCING': '밸런싱', 'BALM': '밤타입', 'BARRIER': '배리어', 'BASE': '베이스메이크업', 'BATH': '배쓰', 'BB쿠션': '비비쿠션', 'BB크림': 'BB', 'BEAUTY': '뷰티', 'BEIGE': '베이지', 'BERGAMOT': '베르가못', 'BEST': '베스트', 'BHA': '바하', 'BIO': '바이오', 'BLACK': '블랙', 'BLOSSOM': '블라썸', 'BLUE': '블루 ', 'BLUSHER': '블러셔', 'BODY': '바디', 'BOOSTER': '부스터', 'BOOSTING': '부스팅', 'BRIGHTENING': '브라이트닝', 'BROW': '아이브로우', 'BROWN': '브라운', 'BRUSH': '브러쉬', 'CALMING': '카밍', 'CARE': '케어', 'CC쿠션': '씨씨쿠션', 'CC크림': 'CC', 'CERAMIDE': '세라마이드', 'CHIC': '시크', 'CITRUS': '시트러스', 'CLEANSER': '클렌저', 'CLEANSING': '클렌징', 'COLOR': '컬러', 'CONCEALER': '컨실러', 'CONTROL': '컨트롤', 'COTTON': '코튼', 'COVER': '커버', 'CREAM': '크림', 'CRUELTYFREE': '크루얼티프리', 'CUSHION': '쿠션 ', 'CUTICLE': '큐티클', 'DAILY': '데일리', 'DARK': '다크', 'DERMA': '더마', 'DOUBLE': '더블', 'DRY': '드라이', 'DUO': '듀오', 'EDITION': '에디션', 'EMULSION': '에멀전', 'ENERGY': '에너지', 'ENRICHED': '인리치드', 'ESPOIR': '에스쁘아', 'ESSENCE': '에센스', 'EYE': '아이', 'EYEBROW': '아이브로우', 'EYELINER': '아이라이너', 'EYESHADOW': '아이섀도우', 'FACE': '페이스', 'FIT': '핏', 'FITTING': '피팅', 'FIX': '픽스', 'FIXING': '픽싱', 'FLORAL': '플로랄', 'FOAM': '폼', 'FOUDATION': '파운데이션', 'FRAGRANCE': '프레그런스', 'FREE': '프리', 'FRESH': '프레쉬', 'FRUITY': '프루티', 'GEL': '겔', 'GINGER': '진저', 'GLOW': '글로우', 'GLYCERINE': '글리세린', 'GRAPEFRUIT': '그레이프프룻', 'GREEN': '그린', 'HAIR': '헤어', 'HAND': '핸드', 'HERA': '헤라', 'HERB': '허브', 'HOMME': '옴므', 'HONEY': '허니', 'HYBRID': '하이브리드', 'IF': '이니스프리', 'INTENSE': '인텐스', 'IVORY': '아이보리', 'JEJU': '제주 ', 'LASH': '래쉬', 'LASTING': '래스팅', 'LAVENDER': '라벤더', 'LIGHT': '라이트', 'LIP': '립', 'LIPSTICK': '립스틱', 'LIQUID': '리퀴드', 'LONGLASTING': '롱라스팅', 'LOTION': '로션', 'MAKEUP': '메이크업', 'MAKE-UP': '메이크업', 'MARINE': '마린', 'MASCARA': '마스카라 ', 'MASK': '마스크', 'MATTE': '매트', 'MELTING': '멜팅', 'MEN': '맨', 'METALLIC': '메탈릭', 'MILD': '마일드', 'MILK': '밀크', 'MINERAL': '미네랄', 'MINT': '민트', 'MIST': '미스트', 'MODI': '모디', 'MOIST': '모이스트', 'MOISTGEN': '모이스트젠', 'MOISTURE': '모이스처', 'MOISTURIZING': '모이스처라이징', 'MULTI': '멀티', 'M-UP': '메이크업', 'MUSK': '머스크', 'NAIL': '네일', 'NARS': '나스', 'NATURAL': '내추럴', 'NOURISHING': '너리싱', 'OIL': '오일', 'OLIVE': '올리브', 'ORANGE': '오렌지', 'ORGANIC': '오가닉', 'PACK': '팩', 'PALETTE': '팔레트', 'PARABEN': '파라벤', 'PEACH': '피치', 'PEARL': '펄', 'PEELING': '필링', 'PEG': '피이지', 'PERFUME': '퍼퓸', 'PINK': '핑크', 'PORCELAIN': '포슬린', 'PORE': '모공', 'POWDER': '파우더', 'POWDERY': '파우더리', 'PRIMER': '프라이머', 'PURE': '퓨어', 'PURIFYING': '퓨리파잉', 'RED': '레드', 'REFINER': '리파이너', 'REFRESHING': '리프레싱', 'REMOVER': '리무버', 'REPAIR': '리페어', 'ROSE': '로즈', 'SAND': '샌드', 'SATIN': '사틴', 'SEBUM': '세범', 'SERUM': '세럼', 'SETTING': '셋팅', 'SHADOW': '아이섀도우', 'SHAPE': '쉐이프', 'SHEET': '시트 ', 'SHINE': '샤인', 'SILICONE': '실리콘', 'SILKY': '실키', 'SKIN': '스킨 ', 'SOAP': '솝', 'SOFT': '소프트', 'SOFTNER': '소프너', 'SOLUTION': '솔루션', 'SOOTHING': '수딩', 'SPA': '스파', 'TEA': '티', 'TEATREE': '티트리', 'TEXTURE': '텍스처', 'TINT': '틴트', 'TONE': '톤 ', 'TONER': '토너', 'TROUBLE': '트러블', 'T존 건조': 'T존건조', 'T존 번들거림': 'T존번들거림', 'UV': '자외선', 'U존 건조': 'U존건조', 'VANILLA': '바닐라', 'VELVET': '벨벳', 'VITAMIN': '비타민', 'VIVID': '비비드', 'VOLUME': '볼륨', 'WATER': '워터 ', 'WATERPROOF': '워터프루프 ', 'YELLOW': '옐로우', '가려움증': '가려움', '가루 날림 방지': '가루날림방지', '가을 보습': '가을보습', '가지런함': '가지런', '각질 관리': '각질관리', '각질 제거': '각질제거', '각질 케어': '각질케어', '갈락토미세스 발효여과물': '갈락토미세스', '감국추출물': '감국', '감귤류': '감귤', '감나무잎': '감잎', '감초추출물': '감초', '강력보습': '보습', '개개인': '개인', '갸꿀': '개꿀', '거뭇거뭇': '거뭇', '거친 피부': '거친피부', '거칠거칠': '거칠', '거칠음': '거침', '거품력': '거품', '거품타입': '거품', '건강기능': '건강기능식품', '건성 케어': '건성케어', '건성피부': '건성', '건성피부용': '건성용', '건조 케어': '건조케어', '건조피부': '건성', '검은콩': '검정콩', '겔타입': '겔', '겨울 선크림': '겨울선크림', '겨울날': '겨울철', '겨울철': '겨울', '견미리 팩트': '견미리팩트', '결 케어 ': '결케어 ', '결점커버': '커버', '겹보습': '보습 ', '경계선': '경계', '계면': '계면활성제', '고광택': '광택', '고기능': '고기능성', '고렴': '고렴이', '고루고루': '고루', '고마주': '고마쥬', '고발색 립스틱': '고발색립스틱', '고산': '고산지대', '고선명': '선명', '고함유': '고함량', '곡선형': '곡선', '골드빛': '골드', '곱슬곱슬': '곱슬', '과다피지': '피지과다', '과다한 피지 분비': '피지과다', '과민감': '과민감성', '과민성 피부': '과민성피부', '과즙향': '과일향', '광대뼈': '광대', '광물유': '광물성오일', '광채감': '광채', '광채효과': '광채', '광택감': '광택', '광택부여': '광택', '광택효과': '광택', '구딸': '아닉구딸', '구성요소': '구성성분', '국산': '국내산', '국소': '국소부위', '국소용': '국소부위용', '굵은 주름': '굵은주름', '그레이프루츠': '그레이프프룻', '그레이프프루트': '그레이프프룻', '그레이프후룻': '그레이프프룻', '그레이프후르츠': '그레이프프룻', '그물망': '그물', '극건성 케어': '극건성케어', '극건조': '극건성', '극민감': '극민감성', '극손상 모발': '극손상모발', '극손상 용': '극손상용', '극손상 케어': '극손상케어', '극진에멀젼': '극진에멀전', '급속 미백': '급속미백', '급속 탄력': '급속탄력', '급속미백': '미백', '급속탄력': '탄력', '기타소품': '소품', '기타퍼프': '퍼프', '긴머리 용': '긴머리용', '긴머리 용 왁스': '긴머리용왁스', '긴장감': '긴장', '길이감': '길이', '깊은 주름': '깊은주름', '깊이감': '깊이', '깜짝깜짝': '깜짝', '꽃향기': '꽃향', '꿀광채': '꿀광', '꿀보습': '보습', '끈적끈적': '끈적', '나이아신': '나이아신아마이드', '나이트전용': '나이트용', '나잇': '나이트', '남성 향수': '남성향수', '남성전용': '남성용', '내추럴 업스타일 빗': '내추럴업스타일빗', '내츄럴': '내추럴 ', '내츄럴그린리프레쉬미스트': '내추럴그린리프레쉬미스트', '내츄럴그린에센스시트마스크': '내추럴그린에센스시트마스크', '내츄럴그린클렌징바': '내추럴그린클렌징바', '내츄럴그린클렌징폼': '내추럴그린클렌징폼', '내츄럴베리립마스크': '내추럴베리립마스크', '내츄럴베리립밤': '내추럴베리립밤', '내츄럴뷰티푸드': '내추럴뷰티푸드', '내츄럴선크림': '내추럴선크림', '내츄럴아이브라우팩트': '내추럴아이브라우팩트', '내츄럴오토펜슬아이브로우': '내추럴오토펜슬아이브로우', '내츄럴우드펜슬아이브로우': '내추럴우드펜슬아이브로우', '내츄럴케익아이브로우키트': '내추럴케익아이브로우키트', '내츄럴퓨리티마일드세럼': '내추럴퓨리티마일드세럼', '내츄럴퓨리티모이스처크림': '내추럴퓨리티모이스처크림', '내츄럴퓨리티밸런싱에멀전': '내추럴퓨리티밸런싱에멀전', '내츄럴퓨리티수딩아이젤': '내추럴퓨리티수딩아이젤', '내츄럴퓨리티클렌징로션': '내추럴퓨리티클렌징로션', '내츄럴퓨리티클렌징젤폼': '내추럴퓨리티클렌징젤폼', '내츄럴퓨리티토너미스트': '내추럴퓨리티토너미스트', '내츄럴필링젤': '내추럴필링젤', '너트맥': '넛맥', '넓은 모공': '넓은모공', '네일 도구': '네일도구', '네일 리무버': '네일리무버', '네일 스티커': '네일스티커', '네일 아트': '네일', '네일 영양': '네일영양', '네일 컬러 ': '네일컬러', '네일 케어': '네일케어', '네일아트': '네일', '네일탑': '탑코트', '네추럴': '내추럴', '네츄럴': '내추럴', '넥 크림': '넥크림', '노란 피부': '노란피부', '노란끼': '노란기', '노랑기': '노란기', '노랑끼': '노란기', '노실리콘': '논실리콘', '노페물': '노폐물', '농축감': '농축', '눈 처짐': '눈쳐짐', '눈가 건조': '눈가건조', '눈가 주름': '눈가주름', '눈가 탄력': '눈가탄력', '눈두덩': '눈두덩이', '눈밑 처짐': '눈밑처짐', '눈섭': '눈썹', '눈처짐': '눈쳐짐', '눈화장': '아이메이크업', '늘어진 모공': '늘어진모공', '다크 서클': '다크서클', '다크써클': '다크서클', '닥토': '닦토', '달맞이꽃유': '달맞이꽃오일', '달콤상콤': '새콤달콤', '달콤상큼': '새콤달콤', '달큰': '달콤 ', '더블케어': '이중케어', '데오': '데오도란트', '데오도런트': '데오도란트', '데오드란트': '데오도란트', '데일리용': '데일리', '데코': '데코레이션', '동글동글': '동글 ', '동물유래성분': '동물성원료', '동물유래원료': '동물성원료', '동백': '동백꽃', '뒷꿈치': '뒤꿈치', '듀오2색': '듀오', '드라이기': '드라이어', '드림오데토일렛': '드림오드뚜왈렛', '등급그린': '그린등급', '디파잉': '디파이닝', '디퓨져': '디퓨저', '따듯': '따뜻', '뚜왈렛': '오드뚜왈렛', '라네즈 뷰러': '라네즈뷰러', '라네즈 크림스킨': '라네즈크림스킨', '라스트': '라스팅', '라이너': '아이라이너', '라이브리프트에멀젼': '라이브리프트에멀전', '락커': '라커', '래스팅': '라스팅', '래시': '래쉬', '래핑': '랩핑', '러쉬 슈렉팩': '러쉬슈렉팩', '레디언스': '래디언스', '렝스닝': '랭쓰닝', '려헤어쿠션': '헤어쿠션', '로레알파리': '로레알', '로션류': '로션', '로션타입': '로션', '로숀 ': '로션', '로얄제리': '로얄젤리', '로얄젤리추출물': '로얄젤리', '로열젤리': '로얄젤리', '로열젤리추출물': '로얄젤리', '로즈사틴': '로지사틴', '롱래스팅': '롱라스팅', '롱래시': '롱래쉬', '루쥬': '루즈', '리츄얼': '리추얼', '리퀴드 라이너': '리퀴드아이라이너', '리퀴드 아이라이너': '리퀴드아이라이너', '리퀴드 파운데이션': '리퀴드파운데이션', '리퀴드타입': '리퀴드', '리퀴드파데': '리퀴드파운데이션', '리터칭': '리터치', '리페어링': '리페어', '리포좀화': '리포좀', '리포즘': '리포좀', '리프트': '리프팅', '리프트업': '리프팅', '릴랙스': '릴렉스', '립 글로스': '립글로스', '립 라이너': '립라이너', '립 리무버': '립리무버', '립 마스크': '립마스크', '립 메이크업': '립메이크업', '립 밤': '립밤', '립 앤 아이 리무버': '립앤아이리무버', '립 케어': '립케어', '립 틴트': '틴트', '립&아이': '립앤아이', '립&아이리무버': '립앤아이리무버', '립&아이펜슬': '립앤아이펜슬', '립라인': '립라이너', '립락커': '립라커', '립스틱노웨어': '노웨어', '립스틱노웨어M': '노웨어M', '립스틱노웨어S': '노웨어S', '립스틱노웨어립타퍼': '노웨어립타퍼', '립스틱노웨어스파클': '노웨어스파클', '립스틱노웨어젠틀매트': '노웨어젠틀매트', '립스틱노웨어파워매트': '노웨어파워매트', '립앤아이 리무버': '립앤아이리무버', '립틴트': '틴트', '마다가스카르산': '마다가스카산', '마뜨': '매트', '마르세이유': '마르세유', '마무리감': '마무리', '마사져': '마사저', '마스카라 타입': '마스카라', '마스크 시트': '마스크시트', '마시멜로우': '마시멜로', '마카다미아넛': '마카다미아', '만다린추출물': '만다린', '말랑말랑': '말랑', '말캉말캉': '말캉', '망고씨': '망고씨드', '망고추출물': '망고 ', '매끈매끈': '매끈', '매일매일': '매일', '매트타입': '매트', '맬로우': '멜로우', '머리결': '머릿결', '머쉬멜로우': '마쉬멜로우', '머스테브': '머스트해브', '멀티 컬러 팔레트': '멀티컬러팔레트', '멀티 토너': '멀티토너', '멀티클렌징': '멀티클렌저', '메이크업 도구': '메이크업도구', '메이크업 리무버': '메이크업리무버', '메이크업 베이스': '메이크업베이스', '메이크업 브러쉬': '브러쉬', '메이크업 브러시': '브러쉬', '메이크업 소품': '메이크업소품', '메이크업 키트': '메이크업키트', '메이크업 픽서': '메이크업픽서', '메이크업스폰지': '메이크업스펀지', '메이크업용 헤어 클립': '헤어클립', '메이크업용 헤어핀': '헤어핀', '메이크업킷': '메이크업키트', '메컵': '메이크업', '모공 개수': '모공개수', '모공 늘어짐': '늘어진모공', '모공 크기': '모공크기', '모공 확장': '넓은모공', '모공수렴': '모공축소', '모공수축': '모공축소', '모공정화': '모공청소', '모공청정': '모공청소', '모공케어': '모공관리', '모던함': '모던', '모발케어': '모발관리', '모이스처세라마이드에멀젼': '모이스처세라마이드에멀전', '모이스쳐': '모이스처', '모이스쳐&리프레시': '모이스처&리프레쉬', '모이스쳐라이저': '모이스처라이저', '모이스쳐라이져': '모이스처라이저', '모이스쳐라이징': '모이스처라이징', '모이스춰': '모이스처', '모이스춰라이저': '모이스처라이저', '모이스춰라이징': '모이스처라이징', '모이스춰바운드': '모이스처바운드', '모이스춰바운드HI크림': '모이스처바운드HI크림', '모이스춰바운드마스크': '모이스처바운드마스크', '모이스춰바운드미스트': '모이스처바운드미스트', '모이스춰바운드바이탈마스크': '모이스처바운드바이탈마스크', '모이스춰바운드세럼': '모이스처바운드세럼', '모이스춰바운드아이젤': '모이스처바운드아이젤', '모이스춰바운드크림': '모이스처바운드크림', '모이스트 보태니컬 헤어브러시': '모이스트보태니컬헤어브러시', '목 탄력': '목탄력', '몽글몽글': '몽글', '무기자외선차단제': '무기자차', '무스타입': '무스', '무알코올': '알코올프리', '무알콜': '알코올프리', '무인공색소': '무색소', '무인공향': '무향료', '무인공향료': '무향료', '무파라펜': '파라벤프리', '무합성색소': '무색소', '무향': '무향료', '무화가': '무화과', '미간 주름': '미간주름', '미간 탄력': '미간탄력', '미디엄': '미디움', '미백기능': '미백', '미백효과': '미백', '미스트타입': '미스트', '미용보습': '보습', '믹싱': '믹스', '민감 케어': '민감케어', '민감 피부': '민감피부', '민감성 피부': '민감피부', '민감한 피부': '민감피부', '밀착감': '밀착', '밀착성': '밀착', '밀착형 ': '밀착', '밀크추출물': '밀크', '바디 로션': '바디로션', '바디 모이스처라이저': '바디모이스처라이저', '바디 미스트': '바디미스트', '바디 밤': '바디밤', '바디 소품': '바디소품', '바디 스크럽': '바디스크럽', '바디 에센스': '바디에센스', '바디 오일': '바디오일', '바디 워시': '바디워시', '바디 젤': '바디젤', '바디 크림': '바디크림', '바디 파우더': '바디파우더', '바디클렌져': '바디클렌저', '바스': '배쓰', '바쓰': '배쓰', '박신혜아이': '박신혜아이메이크업', '반짝반짝': '반짝', '발뒤꿈치': '발꿈치', '발란스': '밸런스', '발림감': '발림성', '발색감': '발색', '발색력': '발색', '발효여과물': '발효물', '발효용해물': '발효물', '발효추출물': '발효물', '밤': '밤타입', '밤형': '밤타입', '배스': '배쓰', '배양추출물': '배양액', '백탁현상': '백탁', '밸런스조절': '밸런싱', '버가못': '베르가못', '번들번들': '번들', '베르가모': '베르가못', '베르가모트': '베르가못', '베리류': '베리 ', '베리어': '배리어', '베리컴플렉스': '베리믹스', '베이스 메이크업': '베이스메이크업', '베이스 코트': '베이스코트', '베이스용': '베이스메이크업', '베이지색': '베이지', '보들보들': '보들', '보디': '바디', '보라빛': '보라색', '보랏빛': '보라색', '보송보송': '보송', '보습 케어': '보습관리', '보습가득': '보습', '보습감': '보습', '보습기능': '보습', '보습도': '보습력', '보습레벨': '보습력', '보습보호막': '보습막', '보습성': '보습', '보습용': '보습', '보습인자': '보습성분', '보습작용': '보습', '보습장벽': '보습막', '보습충전': '보습', '보습케어': '보습관리', '보습효과': '보습', '보태닉': '보타닉', '보테니컬': '보태니컬', '보테닉': '보타닉', '보호기능': '보호', '보호효과': '보호', '복합성 용': '복합성용', '복합성 피부': '복합성', '복합처방': '복합케어', '볼류마이징': '볼류밍', '볼륨감': '볼륨', '볼륨개선': '볼류밍', '볼륨업': '볼류밍', '볼륨효과': '볼륨', '볼쳐짐': '볼처짐', '부기': '붓기', '부담감': '부담', '부들부들': '부들', '부분 마스크': '부분마스크', '부분 팩': '부분팩', '부스터': '부스팅', '부스트': '부스팅', '부족형': '부족', '부착성': '부착력', '분사형': '분사', '분홍빛': '분홍색', '불균일한 피부': '불균일한피부', '붉은 피부': '붉은피부', '붉은끼': '붉은기', '붓펜 라이너': '붓펜아이라이너', '붓펜 아이라이너': '붓펜아이라이너', '뷰티어워드': '뷰티어워즈', '브라운컬러': '브라운', '브러쉬 리무버': '브러쉬클렌저', '브러쉬 클렌저': '브러쉬클렌저', '브러쉬 클렌져': '브러쉬클렌저', '브러쉬 클렌징': '브러쉬클렌저', '브러쉬클렌져': '브러쉬클렌저', '브러쉬클렌징': '브러쉬클렌저', '브러시': '브러쉬', '브러씨': '브러쉬', '브론져': '브론저', '브론즈': '브론저', '브론징': '브론저', '블라섬': '블라썸', '블러링': '블러', '블러쉬': '블러셔', '블러시': '블러셔', '블러싱': '블러셔', '블러썸': '블라썸', '블로섬': '블라썸', '블로썸': '블라썸', '블루베리 토너': '블루베리토너', '블루에너지리차징에멀젼': '블루에너지리차징에멀전', '블링블링': '블링', '비누풀잎추출물': '비누풀잎', '비누향기': '비누향', '비비': 'BB', '비비크림': 'BB', '비타': '비타민', '비타C': '비타민C', '뺨 탄력': '뺨탄력', '뽀송뽀송': '뽀송', '뽀얀': '뽀오얀', '뾰루지 자국': '뾰루지자국', '뾰루지 흉터': '뾰루지흉터', '뾰루지 흔적': '뾰루지흔적', '사각사각': '사각', '사르륵': '사르르', '사용방법': '사용법', '사프론': '사프란', '살리실릭애씨드': '살리실릭산', '살리실산': '살리실릭산', '살포시': '살짝', '상콤': '상큼', '상콤달콤': '새콤달콤', '상큼달콤': '새콤달콤', '새도우': '아이섀도우', '색감': '색깔', '색상': '색깔', '색소 침착': '색소침착', '색조화장': '색조메이크업', '색채': '색깔', '샌들우드': '샌달우드', '생기 없음': '생기없음', '생기가득': '생기', '생기발랄': '생기', '생기부여': '생기', '생기충전': '생기', '생얼': '쌩얼', '샤르르': '사르르', '샤벳': '샤베트', '샤워 코롱': '샤워코롱', '샤워타임': '샤워', '샤이닝 염모제': '샤이닝염모제', '샤프란': '사프란', '샤프론': '사프란', '섀도': '아이섀도우', '섀도우': '아이섀도우', '섀도듀오': '아이섀도우듀어', '섀딩': '쉐딩', '섀이딩': '쉐딩', '석류추출물': '석류', '선 로션': '선로션', '선 스틱': '선스틱', '선 스프레이': '선스프레이', '선 쿠션': '선쿠션', '선 크림': '선크림', '선 파우더': '선파우더', '선 프로텍터': '선크림', '선블락': '선블록', '선프로텍터': '선크림', '설화수 립스틱': '설화수립스틱', '설화수 선크림': '설화수선크림', '설화수 수율크림': '설화수수율크림', '설화수 퍼펙팅쿠션': '설화수퍼펙팅쿠션', '세럼파데': '세럼파운데이션', '세정기타': '세정', '세정효과': '세정', '센스티브': '센서티브', '셀룰로오즈': '셀룰로오스', '셀카': '셀피', '셰어버터': '시어버터', '셰이딩': '쉐딩', '소프트너': '소프너', '속눈섭': '속눈썹', '속눈썹 영양제': '속눈썹영양제', '속눈썹 증모': '속눈썹증모', '속눈썹 탄력': '속눈썹탄력', '속눈썹 풀': '속눈썹풀', '손상모발': '손상모', '송혜교 쿠션': '송혜교쿠션', '수딩 젤': '수딩젤', '수딩 팩': '수딩팩', '수렴작용': '수렴', '수렴효과': '수렴', '수면 팩': '수면팩', '수박추출물': '수박', '수분 부족': '수분부족', '수분 크림': '수분크림', '수분가득': '수분', '수분감': '수분', '수분강화': '수분', '수분광채': '수분광', '수분광택': '수분광', '수분도': '수분량', '수분레벨': '수분량', '수분력': '수분량', '수분보유력': '수분량', '수분보호막': '수분막', '수분부족형': '수분부족', '수분장벽': '수분막', '수분지속': '수분유지', '수분촉촉': '수분보습', '수분충전': '수분', '수분캡슐': '수분방울', '수분캡쳐': '수분유지', '수분코팅': '수분막', '수분코팅막': '수분막', '수분함량': '수분량', '수퍼': '슈퍼', '수퍼허브': '슈퍼허브', '수프림': '슈프림', '순면실크': '순면', '순백색': '순백', '순식물성': '식물성', '쉐어버터': '시어버터', '쉐이딩': '쉐딩', '쉐이브': '쉐이빙', '쉐입': '쉐이프', '쉬어버터': '시어버터', '스무드': '스무스', '스윗': '스위트', '스윗피': '스위트피', '스캘프': '스칼프', '스쿠알렌': '스쿠알란', '스크럽제': '스크럽', '스크류': '스크류브러쉬', '스킨 소품': '스킨소품', '스타일링 브러시': '스타일링브러시', '스타일링 크림': '스타일링크림', '스타일에스쁘아오데토일렛': '스타일에스쁘아오드뚜왈렛', '스틱타입': '스틱', '스틱형': '스틱', '스파츌러': '스파츌라', '스페셜 케어': '스페셜케어', '스폰지': '스펀지', '스폰지팁': '스펀지팁', '스프레이형': '스프레이', '스프레이화이트후로랄': '스프레이화이트플로랄', '스프레이후레쉬후로랄': '스프레이프레쉬플로랄', '스피어민트': '스피아민트', '슬리핑 뷰티': '슬리핑뷰티', '슬리핑 케어': '슬리핑뷰티', '슬리핑 팩': '슬리핑팩', '슬리핑마스크': '슬리핑팩', '시그니쳐': '시그니처', '시드': '씨드', '시머': '쉬머', '시머링': '쉬머링', '시빼테': '시럽빼고테이크아웃', '시트 마스크': '시트마스크', '시트원단': '시트재질', '시트팩': '시트마스크', '식물유래': '식물성', '식물추출물': '식물성분', '식약처': '식약청', '식품의약품안전처': '식품의약품안전청', '신비로움': '신비', '실키터치': '실키', '쌀겨추출물': '쌀겨', '쌉사름': '쌉쌀', '쌉싸름': '쌉쌀', '쌍커풀': '쌍꺼풀', '써클': '서클', '써클라인': '서클라인', '썬 스틱': '선스틱', '썬 케어': '선케어', '썬로션': '선로션', '썬베이스': '선베이스', '썬스틱': '선스틱', '썬케어': '선케어', '썬쿠션': '선쿠션', '썬크림': '선크림', '썬플라워': '선플라워', '쎄럼': '세럼', '쎄서미': '세서미', '쎌루라': '셀루라', '쓱싹쓱싹': '쓱싹', '씨씨': 'CC', '씨씨크림': 'CC', '씨트러스': '시트러스', '씰링': '실링', '아가': '아기', '아모스 미스트': '아모스미스트', '아웃도어용': '아웃도어', '아이 라이너': '아이라이너', '아이 래쉬': '아이래쉬', '아이 리무버': '아이리무버', '아이 브로우': '아이브로우', '아이 섀도': '아이섀도우', '아이 섀도우': '아이섀도우', '아이 크림': '아이크림', '아이 프라이머': '아이프라이머', '아이돌 아이라이너': '아이돌아이라이너', '아이돌래시': '아이돌래쉬', '아이라이너브러시': '아이라이너브러쉬', '아이메컵': '아이메이크업', '아이브라우': '아이브로우', '아이브로우 마스카라': '아이브로우마스카라', '아이새도우': '아이섀도우', '아이섀도': '아이섀도우', '아이슬란딕': '아이슬란드', '아이케어기타': '아이케어', '아쿠아볼릭모이스처라이징에멀젼': '아쿠아볼릭모이스처라이징에멀전', '악건성 케어': '악건성케어', '안개분사형': '안개분사', '안티에이지': '안티에이징', '알러지': '알레르기', '알로에베라잎즙': '알로에베라잎수', '알로에베라잎추출물': '알로에베라잎수', '알로에추출물': '알로에 ', '알콜': '알코올 ', '알콜프리': '알코올프리', '애프터 쉐이브': '애프터쉐이브', '앰풀': '앰플', '앰플형': '앰플', '얇은 피부': '얇은피부', '양모효과': '양모', '어두운 피부톤': '어두운피부톤', '어린쑥 미스트': '어린쑥미스트', '어린아이': '어린이', '언더래시': '언더래쉬', '얼굴빛': '얼굴색', '얼굴선': '얼굴라인', '얼굴윤곽': '얼굴라인', '얼굴톤': '얼굴색', '얼룩짐': '얼룩', '에멀션': '에멀전', '에멀젼': '에멀전', '에센셜밸런싱에멀젼': '에센셜밸런싱에멀전', '에스쁘아드림오데토일렛': '에스쁘아드림오드뚜왈렛', '에스트라 아토베리어 크림': '에스트라아토베리어크림', '에쎈스': '에센스', '에이피몰': 'AP몰', '에코뷰티툴팩스패튤라': '에코뷰티툴팩스파츌라', '에프터 쉐이브': '애프터쉐이브', '여드름 자국': '여드름자국', '여드름 흉터': '여드름흉터', '여드름 흔적': '여드름흉터', '여름날': '여름', '여름철': '여름', '여성 손톱깎이': '손톱깎이', '여성 청결제': '여성청결제', '여성 향수': '여성향수', '여주': '여주인공', '연고형': '연고', '연출가능': '연출', '열기': '열감', '염모제': '염색약', '염색모발': '염색모', '염색제': '염색약', '영롱보스': '영롱', '영롱함': '영롱', '영양 크림': '영양크림', '영양감': '영양', '영양공급효과': '영양공급', '영양분': '영양성분', '영양소': '영양성분', '영양인자성분': '영양성분', '영양케어': '영양', '옐로': '옐로우', '오가니언스에멀젼': '오가니언스에멀전', '오늘날': '오늘', '오데토일렛': '오드뚜왈렛', '오드': '오드퍼퓸', '오래오래': '오래', '오랜지': '오렌지', '오렌지블로썸': '오렌지블라썸', '오리지널': '오리지날', '오메가': '오메가3', '오설록 핸드크림': '오설록핸드크림', '오염물': '오염물질', '오일감': '유분감', '오일성분': '오일', '오일타입': '오일', '옴므스윙블루오데토일렛': '옴므스윙블루오드뚜왈렛', '옴므텐인원퍼펙트모이스춰': '옴므텐인원퍼펙트모이스처', '완벽밀착': '밀착', '완벽커버': '커버', '우유빛': '우윳빛', '우유빛깔': '우윳빛', '울트라리페어모이스춰워시': '울트라리페어모이스처워시', '울트라리페어모이스춰크림': '울트라리페어모이스처크림', '워시오프 팩': '워시오프팩', '워터멜론': '수박', '워터푸르프': '워터프루프', '워터프루프라이너': '워터프루프아이라이너', '원스톱': '원스탑', '원터치형': '원터치', '유분기': '유분', '유브이': '자외선 ', '유산과도': '유산과다', '유연작용': '유연', '유해물질': '유해성분', '유해세균': '유해균', '유해요소': '유해성분', '유해의심성분': '유해성분', '육두구': '넛맥', '윤곽선': '윤곽', '윤기감': '윤기', '윤기강화': '윤기', '윤기개선': '윤기', '윤기부여': '윤기', '윤기케어': '윤기', '윤기코팅': '윤기', '음영감': '음영', '음파 진동 눈썹칼': '음파진동눈썹칼', '음파진동 눈썹 면도기': '음파진동눈썹면도기', '이레이저': '이레이져', '이사배 메이크업': '이사배메이크업', '이중보습': '보습', '이중세안': '세안', '이중차단': '차단', '인공적': '인공', '인공향': '인공향료', '일상생활': '일상', '일상적': '일상', '일제인조모': '인조모', '일체형': '일체', '임상시험': '임상', '임상실험': '임상', '임상테스트': '임상', '입 주변 여드름': '입주변여드름', '입 주변 트러블': '입주변여드름', '입가 건조': '입가건조', '입가 여드름': '입가여드름', '입술관리': '입술케어', '입술라인': '입술선', '입술보호': '입술케어', '입술연출': '입술표현', '입자감': '입자', '입주변 여드름': '입주변여드름', '자극감': '자극', '자극성': '자극', '자극염려성분': '자극성분', '자연보습': '보습', '자연유래': '자연유래성분', '자외선 차단': '자외선차단', '자외선차단기능성': '자외선차단', '자차': '자외선차단', '자차제': '자외선차단제', '장미빛': '장밋빛', '장벽 케어': '장벽케어', '장벽강화': '장벽 ', '장벽기능': '장벽', '장수말벌추출물': '장수말벌', '재생기능': '재생', '재오염': '오염 ', '저자극성': '저자극', '절세미인': '미인', '정화능력': '정화력', '정화작용': '정화', '제주 한란': '한란', '제주도': '제주', '제주영귤': '영귤', '제주한란': '한란', '제주화산송이': '화산송이', '젤 LED램프': '젤LED램프', '젤 라이너': '젤아이라이너', '젤 아이라이너': '젤아이라이너', '젤 크림': '젤크림', '젤네일램프': '젤램프', '젤라이너': '젤아이라이너', '젤리퀴드라이너': '젤리퀴드아이라이너', '젤퀴드': '젤리퀴드 ', '젤타입': '젤 ', '족집게': '족집게', '좁쌀 여드름': '좁쌀여드름', '주름완화': '주름개선', '중성 피부': '중성', '지복합': '지복합성', '지복합성 보습크림': '지복합성보습크림', '지성피부용': '지성용', '지속성': '지속', '지속적': '지속', '지속효과': '지속', '진액에멀젼': '진액에멀전', '진정보호': '진정', '진정작용': '진정', '진정케어': '진정', '진정효과': '진정', '진주빛': '진줏빛', '짐승용량': '대용량', '집중관리': '관리', '집중보습': '보습', '집중영양': '영양', '집중케어': '케어', '쫀득쫀득': '쫀득', '쫀존': '쫀쫀', '차단기능': '차단력', '차단지수': '차단력', '차단효과': '차단력', '찰랑찰랑': '찰랑', '처방인공색소': '인공색소', '천연보습인자': '천연보습성분', '천연원료': '천연성분', '천연유래': '천연성분', '천연유래성분': '천연성분', '천연추출물': '천연성분', '천연향': '천연향료', '철벽방어': '방어', '청보리버블클렌져': '청보리버블클렌저', '청정효과': '청정', '쳐짐': '처짐', '쳔연': '천연', '쳔연소재': '천연소재', '초간단': '간단', '초간편': '간편', '초강력': '강력', '초경량': '경량', '초고밀착': '고밀착', '초고보습': '고보습', '초콜렛': '초콜릿', '쵸코': '초콜릿', '추출수': '추출물', '추출액': '추출물', '취저': '취향저격', '칙칙한 피부톤': '칙칙한피부톤', '친화성': '친화', '친화적': '친화', '카렌둘라': '카렌듈라', '캬라멜': '카라멜', '커버링': '커버', '커버용': '커버', '컨씰러': '컨실러', '컨투어블러쉬': '컨투어브러쉬', '컬러링': '컬러연출', '컬러메이크업': '색조메이크업', '컬러발색': '발색', '컬러표현': '컬러연출', '컬러화장': '색조메이크업', '컴팩트   ': '콤팩트', '컴팩트 뷰러': '콤팩트뷰러', '컴플렉션': '콤플렉스', '컴플렉스': '콤플렉스', '케어보습': '보습', '케어용': '케어', '코 팩': '코팩', '코럴': '코랄', '코팅효과': '코팅', '콘트롤': '컨트롤', '콜렉션': '컬렉션', '콧방울': '콧망울', '콩오일': '콩기름', '쿠션타입': '쿠션', '쿠션팩트': '쿠션', '쿠션형': '쿠션', '쿨링감': '쿨링', '쿨링케어': '쿨링', '쿨링효과': '쿨링', '퀵 드라이': '퀵드라이', '크리미스틱섀도': '크리미스틱섀도우', '크림제형': '크림', '크림타입': '크림', '크림형': '크림', '클렌져': '클렌저', '클렌징 로션': '클렌징로션', '클렌징 밀크': '클렌징밀크', '클렌징 비누': '클렌징비누', '클렌징 오일': '클렌징오일', '클렌징 워터': '클렌징워터', '클렌징 젤': '클렌징젤', '클렌징 크림': '클렌징크림', '클렌징 티슈': '클렌징티슈', '클렌징 폼': '클렌징폼', '클렌징에멀젼': '클렌징에멀전', '클렌징인핸서바디브러시': '클렌징인핸서바디브러쉬', '클렌징인핸서코랄브러시': '클렌징인핸서코랄브러쉬', '클렌징인핸서퍼플브러시': '클렌징인핸서퍼플브러쉬', '클렌징인핸서화이트브러시': '클렌징인핸서화이트브러쉬', '클렌징팩': '워시오프팩', '클린저': '클렌저', '클린징': '클렌저', '타르계색소': '타르색소', '탄력감': '탄력', '탄력라인': '탄력', '탄력부여': '탄력', '탄력업': '탄력강화', '탄력적': '탄력', '탄력피부': '탄력', '탄력효과': '탄력', '탄탄함': '탄탄', '탈모증상완화': '탈모방지', '탈모증상케어': '탈모방지', '탈취효과': '탈취', '탑 코트': '탑코트', '탱글탱글': '탱글', '탱탱함': '탱탱', '텁텁함': '텁텁', '텍스쳐': '텍스처', '텍스춰': '텍스처', '토털': '토탈', '톤업 크림': '톤업크림', '톤업효과': '톤업 ', '톱노트': '탑노트', '통가콩': '통카빈', '통카콩': '통카빈', '투명감': '투명', '투명함': '투명', '튜브타입': '튜브', '튜브형': '튜브', '트러블 자국': '트러블자국', '트러블 흉터': '트러블흉터', '트러블 흔적': '트러블흔적', '특별함': '특별', '특성상': '특성', '티슈타입': '티슈', '티슈형': '티슈', '파데': '파운데이션', '파데쿠션': '쿠션파운데이션', '파라펜': '파라벤', '파란': '파란색', '파리지엔': '파리지앵', '파우더 타입': '파우더', '파우더 팩트': '파우더팩트', '파우더류': '파우더', '파우더스폰지': '파우더스펀지', '파우더타입': '파우더', '파운데이션 쿠션': '쿠션파운데이션', '파출리': '파촐리', '파츌리': '파촐리', '팔자 주름': '팔자주름', '패디': '페디', '패디스티커': '페디스티거', '패디아트': '페디아트', '패뷸러스블러쉬': '패뷸러스블러셔', '패츌리': '파촐리', '패턴감': '패턴', '팩트형': '팩트', '퍼머제': '펌제', '퍼밍효과': '퍼밍', '퍼펙트쉐이딩스틱': '퍼펙트쉐딩스틱', '펀바이에스쁘아오데토일렛': '펀바이에스쁘아오뜨뚜알렛', '펌프식': '펌프', '페이스 오일': '페이스오일', '페이스 워시': '페이셜워시', '페이스 프라이머': '프라이머', '페트롤라툼': '페트롤라튬', '펜슬 라이너': '펜슬아이라이너', '펜슬 아이라이너': '펜슬아이라이너', '펜슬라이너': '펜슬아이라이너', '편백': '편백나무', '포름알데하이드': '포름알데히드', '포물라': '포뮬라', '포뮬러': '포뮬라', '포어': '모공', '포어케어': '모공관리', '폭신폭신': '폭신', '폼 클렌징': '폼클렌징', '폼클렌져': '폼클렌저', '폼클렌징': '폼클렌저', '푸석거림': '푸석', '푸석푸석': '푸석', '푸석함': '푸석', '풀커버': '커버', '퓨어에스쁘아오데토알렛': '퓨어에스쁘아오뜨뚜알렛', '퓨어에스쁘아오데토일렛': '퓨어에스쁘아오뜨뚜알렛', '퓨어화이트에멀젼': '퓨어화이트에멀전', '프래그런스': '프레그런스', '프레쉬모이스춰바디로션': '프레쉬모이스처바디로션', '프레쉬모이스춰바디미스트': '프레쉬모이스처바디미스트', '프레쉬모이스춰바디워시': '프레쉬모이스처바디워시', '프레쉬모이스춰선크림': '프레쉬모이스처선크림', '프레쉬모이스춰수딩젤': '프레쉬모이스처수딩젤', '프레쉬모이스춰스크럽워시': '프레쉬모이스처스크럽워시', '프레시모이스처에멀젼': '프레시모이스처에멀전', '프로폴리스추출물': '프로폴리스', '프루츠': '프루트', '프룻 ': '프루트', '프룻티': '프루티', '프리미엄급': '프리미엄', '프리지어': '프리지아', '프테쿠션': '프로테일러쿠션', '플라스틱 뷰러': '플라스틱뷰러', '플래티늄': '플래티넘', '플로럴 ': '플로랄', '플로럴계열': '플로랄', '피니쉬': '피니시', '피부 손상예방': '피부손상예방', '피부 컨디션': '피부컨디션', '피부 컨디션 케어': '피부컨디션케어', '피부각질': '각질', '피부갈증': '건조', '피부건조': '건조', '피부결 개선': '피부결개선', '피부결정돈': '피부정돈', '피부광채': '광채', '피부막': '피부보호막', '피부미백': '미백', '피부보습': '보습', '피부빛': '피부색', '피부생기': '생기', '피부수분': '수분', '피부영양': '영양', '피부요철': '요철', '피부윤기': '윤기', '피부자극': '자극', '피부자극테스트': '자극테스트', '피부진정': '진정', '피부탄력': '탄력 ', '피부탄력증진': '탄력강화', '피부트러블': '트러블', '피부화장': '화장 ', '피부효능': '효능', '피지 분비': '피지분비', '피지컨트롤': '피지조절', '필름타입': '필름', '필수템': '필수품', '필오프 팩': '필오프팩', '핏감': '핏', '핑크 뷰러': '핑크뷰러', '핑크 손톱깎이': '핑크손톱깎이', '핑크빛': '핑크색', '한방내추럴': '한방 ', '한방원료': '한방성분', '한방추출물': '한방성분', '함유량': '함량', '합성향': '합성향료', '항산화력': '항산화', '핸드 밤': '핸드밤', '핸드 버터': '핸드버터', '핸드 케어': '핸드케어', '핸드 크림': '핸드크림', '핸드네일크림': '핸드크림', '핸드로션': '핸드크림', '햇볕': '햇빛', '햇살': '햇빛', '행복감': '행복', '헤라 립': '헤라립', '헤라 립글로스': '헤라립글로스', '헤라 립스틱': '헤라립스틱', '헤라 립틴트': '헤라립틴트', '헤라 미스트쿠션': '헤라미스트쿠션', '헤라 선크림': '헤라선크림', '헤어 기기': '헤어기기', '헤어 라이너': '헤어라이너', '헤어 미스트': '헤어미스트', '헤어 볼륨': '헤어볼륨', '헤어 섀도우': '헤어섀도우', '헤어 세럼': '헤어세럼', '헤어 소품': '헤어소품', '헤어 에센스': '헤어에센스', '헤어 오일': '헤어오일', '헤어 컬러링': '헤어컬러링', '헤어 쿠션': '헤어쿠션', '헤어 클립': '헤어클립', '헤어 트리트먼트': '헤어트리트먼트', '헤어 팩': '헤어팩', '헤어 퍼프': '헤어퍼프', '헤어라인 여드름 ': '헤어라인여드름 ', '헤어라인 트러블': '헤어라인트러블', '헬로키티 눈썹수정칼': '헬로키티눈썹수정칼', '헬로키티 손거울': '헬로키티손거울', '헬로키티 손톱깎이': '헬로키티손톱깎이', '헬로키티 족집게': '헬로키티족집게', '헬로키티 핑크 컴팩트 뷰러': '헬로키티핑크콤팩트뷰러', '헬씨': '헬시', '홈에스테틱': '홈케어', '화이트젠에멀젼': '화이트젠에멀전', '화장빨': '화장발', '활력부여': '활력', '회전식': '회전', '회전형': '회전', '후레그런스': '프레그런스', '후레쉬': '프레쉬', '후로랄': '플로랄', '후루티': '프루티', '후르티': '프루티', '후리지아': '프리지아', '훌로랄': '플로랄', '훼이셜': '페이셜', '훼이셜오일': '페이셜오일', '훼이셜요거트매끈폼': '페이셜요거트매끈폼', '훼이셜요거트산뜻폼': '페이셜요거트산뜻폼', '훼이셜요거트순한폼': '페이셜요거트순한폼', '훼이셜요거트촉촉폼': '페이셜요거트촉촉폼', '훼이셜워시': '페이셜워시', '훼이셜클렌징': '페이셜클렌징', '훼이셜폼': '페이셜폼', '훼이스': '페이스', '휘핑': '휘핑크림', '휴대용 뷰러': '휴대용뷰러', '흔적 케어': '흔적케어', '흡수감': '흡수', '흡수력': '흡수', '히아루로산': '히알루론산', '히아루론': '히알루론산', '히아루론산': '히알루론산', '히알루로산': '히알루론산', '히알루론': '히알루론산', '히야신스': '히아신스', '쌤플': '샘플', '클워': '클렌징워터', '닦토용': '닦토', '땡김': '당김', '애굣살': '애교살', '갈웜': '가을웜톤', 'LG생활과학': 'LG생활건강'}